Revit 2024 API
DirectShapeLibrary.Reset Method
 Removes all definitions from library. This is useful when importing several self-contained data sets within one session. Once a data set is imported, keeping the definitions specific to that data set will slow down the searches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void Reset()
Visual Basic
Public Sub Reset
Visual C++
public:
void Reset()
See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace